Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 48, 48, 40)        1040      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 48, 48, 40)        40040     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 48, 48, 40)        40040     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 24, 24, 40)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 24, 24, 60)        60060     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 24, 24, 60)        90060     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 24, 24, 60)        90060     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 12, 12, 60)        0         
_________________________________________________________________
locally_connected2d_3 (Local (None, 10, 10, 100)       5410000   
_________________________________________________________________
locally_connected2d_4 (Local (None, 8, 8, 100)         5766400   
_________________________________________________________________
flatten_2 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                409664    
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_6 (Dense)              (None, 7)                 455       
=================================================================
Total params: 11,911,979
Trainable params: 11,911,979
Non-trainable params: 0

Done Training: 
Final Training Accuracy:  0.6948148870401701
Final Validation Accuracy:  0.5468373401831019
3589/3589 [==============================] - 1s 357us/step
Evaluation Accuracy:  0.54258567856161266
