Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 48, 48, 32)        320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 48, 48, 32)        9248      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 48, 48, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 24, 24, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 24, 24, 64)        18496     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 24, 24, 64)        36928     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 24, 24, 64)        36928     
_________________________________________________________________
locally_connected2d_1 (Local (None, 21, 21, 32)        14464800  
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 21, 21, 128)       36992     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 21, 21, 128)       147584    
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 21, 21, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                819264    
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 455       
=================================================================
Total params: 15,732,007
Trainable params: 15,732,007
Non-trainable params: 0

Epoch 00016: early stopping
Done Training: 
Final Training Accuracy:  0.5197551751592356
Final Validation Accuracy:  0.36735167768266463
Overfit Ratio:  0.7067782972437366
3589/3589 [==============================] - 2s 614us/step
Evaluation Loss:  1.6529341632524683
Evaluation Accuracy:  0.360267483987128