Model:
	- 1-Phase Local Connected Convolution
		- Non-Active Padding
	- 3-Phase Basic Conv-Pool
		- Active Padding
	- Dropout

Layer (type)                 Output Shape              Param #   
=================================================================
locally_connected2d_2 (Local (None, 45, 45, 8)         275400    
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 45, 45, 32)        2336      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 45, 45, 32)        9248      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 45, 45, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 22, 22, 64)        18496     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 22, 22, 64)        36928     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 22, 22, 64)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 11, 11, 128)       73856     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 11, 11, 128)       147584    
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 11, 11, 128)       147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 5, 5, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                204864    
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 455       
=================================================================
Total params: 967,087
Trainable params: 967,087
Non-trainable params: 0

Done Training: 
Final Training Accuracy:  0.6359972133757962
Final Validation Accuracy:  0.4276094276647901
Overfit Ratio:  0.672344813265912
1536/3589 [===========>..................] - ETA: 1s3589/3589 [==============================] - 2s 579us/step
Evaluation Loss:  1.8039232758168358
Evaluation Accuracy:  0.43187517414736726